// ► Разработать класс Money для представления сумм (в рублях и копейках) 
//   с набором конструкторов, геттеров и сеттеров, методом toString()
// ► При помощи методов класса перегрузите операции:
//   + для сложения двух сумм 
//   - для вычитания двух сумм
//   * для умножения суммы на вещественное число – перевод в другую валюту
// ► При помощи дружественных функций перегрузите операции 
//   ввода и вывода, 
//   сравнения(== , != ) и отношения(<, <= , >= , >).
//   Для реализации сравнений и отношений переведите сумму в копейки и сравнивайте 
//   полученные числа


#include "stdafx.h"
#include "Application.h"

int main()
{
	Application* app = new Application();
	
	app->run();

	delete app;
    return 0;
}

